In [1]:
import pandas as pd

In [ ]:
# conda install openpyxl

In [16]:
path_csv = './dataset/StockData.csv'
data_csv = pd.read_csv(path_csv)

path_excel = './dataset/StockData.xlsx'
data_excel = pd.read_excel(path_excel)

In [7]:
data_csv.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [8]:
data_csv.tail()

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

In [17]:
data_excel.head()

  stock       date    price
0  AAPL 2013-02-08  67.8542
1  AAPL 2013-02-11  68.5614
2  AAPL 2013-02-12  66.8428
3  AAPL 2013-02-13  66.7156
4  AAPL 2013-02-14  66.6556

In [18]:
data_excel.tail()

     stock       date  price
5031   ZTS 2018-02-01  77.82
5032   ZTS 2018-02-02  76.78
5033   ZTS 2018-02-05  73.83
5034   ZTS 2018-02-06  73.27
5035   ZTS 2018-02-07  73.86

In [20]:
# save

data_csv.to_csv('./dataset/Saved_StockData.csv',index=False)
data_excel.to_excel('./dataset/Saved_StockData.xlsx',index=False)

In [23]:
data_csv.shape

(5036, 3)

In [21]:
data_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [24]:
# check the minimum value of a numeric column
data_csv['price'].min()

28.4

In [25]:
# check the maximum value of a numeric column
data_csv['price'].max()

179.26

In [26]:
# check the unique value present in a column
data_csv['stock'].unique()

array(['AAPL', 'SNI', 'TJX', 'ZTS'], dtype=object)

In [27]:
# check the number of values that each unique quantity has in a column
data_csv['stock'].value_counts()

stock
AAPL    1259
SNI     1259
TJX     1259
ZTS     1259
Name: count, dtype: int64

In [28]:
# value_counts(normalize=True) - using the `normalize` parameter and initializing it to True will return the relative frequencies of the unique values
data_csv['stock'].value_counts(normalize=True)

stock
AAPL    0.25
SNI     0.25
TJX     0.25
ZTS     0.25
Name: proportion, dtype: float64